<?php
namespace App\Chung;

use Func;

/*
    공통변수(일반 공통 변수는 코드관리를 가져다 쓰고 여기는 시스템 변수만 넣을것)
*/

class Vars
{
    
    // 현 최고금리
    public static $curMaxRate     = 20;
    public static $curMaxRateDate = "2021.07.07";


    public static $CMS_BANK_CD  = "011";
    public static $CMS_BANK_SSN = "3010212975021";
    
    // 자동 로그아웃 이동 시간 (분)
    public static $refreshToLogoutTm = 65;

	/**
     * 계약상태
     *
     * @var array
     */
    public static $arrayContractSta = array(
        'A'=>'정상',
		'B'=>'연체',
		'C'=>'화해정상',
		'D'=>'화해연체',
		'E'=>'종료',
		'S'=>'상각',
		'M'=>'매각',
        'Y'=>'양도',
        'H'=>'환매',
        'P'=>'만기연장종료',
        'N'=>'대기',
        'X'=>'철회',
    );

	/**
    * 계약상태 색상
    *
    * @var array
     */
    public static $arrayContractStaColor = array(
        'A'=>'<span class="status-text-a">정상</span>',
        'B'=>'<span class="status-text-b">연체</span>',
        'C'=>'<span class="status-text-c">화해정상</span>',
        'D'=>'<span class="status-text-d">화해연체</span>',
        'E'=>'<span class="status-text-e">종료</span>',
        'S'=>'<span class="status-text-s">상각</span>',
        'M'=>'<span class="status-text-m">매각</span>',
        'N'=>'<span class="status-text-n">대기</span>',
        'X'=>'<span class="status-text-x">철회</span>',
        'Y'=>'<span class="status-text-x">양도</span>',
        'H'=>'<span class="status-text-x">환매</span>',
        'P'=>'<span class="status-text-p">만기연장종료</span>',
    );
    
    /**
     * 계약상태 검색용
     *
     * @var array
     */
    public static $arrayContractStaSearch = array(
        'A'=>'정상',
		'B'=>'연체',
		'C1'=>'화해정상',
		'D1'=>'화해연체',
        // 'C2'=>'개회정상',
		// 'D2'=>'개회연체',
        // 'C3'=>'신복정상',
		// 'D3'=>'신복연체',
		'E'=>'완제',
		'S'=>'상각',
		'M'=>'매각',
        'Y'=>'양도',
        'H'=>'환매',
        'P'=>'만기연장종료',
    );

    /**
     * 계약상태별 색상
     * 색상 변경시 custom.css status관련 수정 필요
     *
     * @var array
     */
    public static $arrayStaColor = array(
        'A'=>'#53a6ff',
        'B'=>'#d54062',
        'C'=>'#799351',
        'D'=>'#ba7967',
        'E'=>'#6c757d',
        'S'=>'#8a0077',
        'M'=>'#5a0000',
        'N'=>'#999999',
        'X'=>'#999999', 
        'Y'=>'#999999',
        'H'=>'#999999',
        'P'=>'#61d414',
    );

    /**
     * 계약서 징구 상태코드 loan_info.DOC_STATUS_CD
     */
    public static $arrayDocStatus = array(
        'N'=>'미징구',
        'A'=>'일부징구',
        'Y'=>'징구완료',
    );

    /**
     * 메세지 타입
     *
     * @var array
     */
    public static $arrayMsgType = array(
        'M'=>'메세지',
		'N'=>'공지',
		'S'=>'알람',
		
    );
    public static $arrayMsgLevel = array(
        'gray'    => '일반',
		'success' => '성공',
		'info'    => '정보',
        'warning' => '경고',
        'error'   => '오류',
		
    );

    /**
     * 기능권한관리 ( 최상위 메뉴코드 => 해당메뉴의 기능권한 추가 )
     *
     * @var array
     */
    public static $arrayFuncPermit = array(
           // 인트라넷
            '001' => Array( 
                'I001' => '게시판 관리자',
            ),
            // 투자자관리
            '002' => Array(
                'U002' => '엑셀다운로드(투자자관리)',
                'U003' => '송금요청',
            ),
           // 상품계약관리     
            '003' => Array(
                'E001' => '엑셀다운로드(상품계약관리)',
                'E002' => '전지점계약열람',
            ),    
            // 법인관리    
            '004' => Array(
                'C001' => '엑셀다운로드(법인관리)', 
            ),
            // 비용관리    
            '005' => Array(
                'M001' => '엑셀다운로드(비용관리)', 
            ),
            // 계좌관리    
            '006' => Array(
                'A001' => '엑셀다운로드(계좌관리)', 
            ),
            // 법인통장관리    
            '007' => Array(
                'Q001' => '엑셀다운로드(법인통장관리)', 
            ),
            // 인사관리    
            '008' => Array(
                'P001' => '엑셀다운로드(인사관리)', 
            ),
            // 결재업무
            '009' => Array(
                'Z001' => '이체실행승인',
            ),
            // 보고서
            '010' => Array(
                'H001' => '엑셀다운로드', 
            ),
            // Development
            'DEV' => Array(
                
            ),
            // Extras
            'EXT' => Array(
                
            ),
        );

    /**
     * 로그인 기록 로그인 성공 여부 코드
     *
     * @var array
     */
    public static $arrayLoginSuccess = Array(
        'Y' => '로그인 성공',
        'N' => '로그인 실패',
        'L' => '로그인 잠김',
        'I' => '아이피 차단',
        'P' => '비밀번호 미변경',
        'O' => '로그아웃',
        'A' => '권한없는페이지접근',
    );

    /**
    * SMS 파싱열 - 공통
    *
    *
    * @var array
    */
    public static $arraySmsCommonParser = Array(
        //'[발송직원]'            => 'common__auth_id',
        '[오늘년월일]'          => 'common__today_ymd',
        '[오늘월일]'            => 'common__today_md',
        '[오늘일]'              => 'common__today_d',
        '[법정최고금리]'        => 'common__max_rate',
        '[이자정책기준년월일]'   => 'common__max_rate_date',

        '[기준일]'         => 'common__sms_basis_date',
        '[방문예정월일]'    => 'common__visit_date',
        '[방문예정시간]'    => 'common__visit_time',
        '[방문예정장소]'    => 'common__visit_local',
        //'[이자정책기준일]'      => 'common__max_rate_date',
        //'[팩스번호]'            => 'common__fax_number',
    );

    /**
    * SMS 파싱열 - 회수
    *
    *
    * @var array
    */
    public static $arraySmsErpParser = Array(
        '[계약번호]'        => 'LOAN_INFO__loan_info_no',
        '[고객명]'          => 'LOAN_INFO__name',
        '[계약일]'          => 'LOAN_INFO__contract_date',
        '[만기일]'          => 'LOAN_INFO__contract_end_date',
        '[만기일(.)]'       => 'LOAN_INFO__contract_end_date2',
        '[대출일]'          => 'LOAN_INFO__loan_date',
        '[대출액]'          => 'LOAN_INFO__loan_money',
        '[핸드폰번호]'      => 'LOAN_INFO__ph2',
        '[연체발생일]'      => 'LOAN_INFO__return_date_biz',
        //'[청구예정금액]'    => 'LOAN_INFO__return_money',
        '[상환일이자]'      => 'LOAN_INFO__return_date_interest',
		'[상환일]'     		 => 'LOAN_INFO__return_date',
		'[상환일월일]'     	=> 'LOAN_INFO__return_date2',
		'[연체일수]'      	=> 'LOAN_INFO__delay_term',
        '[당일정상이자]'    => 'LOAN_INFO__interest',
        '[당일지연배상금]'  => 'LOAN_INFO__delay_money',
        '[당일연체이자]'    => 'LOAN_INFO__delay_interest',
        '[당일부족금]'      => 'LOAN_INFO__lack_money',
        '[이자합계]'        => 'LOAN_INFO__interest_sum',
        '[당일청구금액]'    => 'LOAN_INFO__charge_money',
        '[완납액]'          => 'LOAN_INFO__fullpay_money',          // 원래 [완납금액]
        '[만기일완납금액]'  => 'LOAN_INFO__fullpay_moneye',
        '[가수금]'          => 'LOAN_INFO__over_money',
        '[잔액]'            => 'LOAN_INFO__balance',
        '[약정일]'          => 'LOAN_INFO__contract_day',
        '[가상계좌번호]'    => 'vir_acct__vir_acct_ssn',
        '[가상계좌은행]'    => 'vir_acct__vir_bank_nm',
        '[가상계좌]'        => 'vir_acct__vir_acct_full',         // 은행명과 계좌번호 동시 출력
        '[가상계좌은행(풀)]'=> 'vir_acct__vir_bank_nm_full',
        '[입금일]'          => 'LOAN_INFO_trade__trade_date',
        '[입금금액]'        => 'LOAN_INFO_trade__trade_money',
        '[입금이자]'        => 'LOAN_INFO_trade__return_interest_sum',
        '[입금취소년월일]'      => 'LOAN_INFO_trade__cancel_date',
        '[입금취소금액]'        => 'LOAN_INFO_trade__cancel_money',
        '[상환액]'          => 'LOAN_INFO__monthly_return_money',         // 원래 [월상환액]
        '[월상환액]'        => 'LOAN_INFO__monthly_return_money',         
        '[최근납입일]'        => 'LOAN_INFO__last_in_date',
        '[최근납입금]'        => 'LOAN_INFO__last_in_money',
        '[추심착수안내금액]'  => 'LOAN_INFO__charge_money_59',      // 화홰와 일반구분

        //'[방문예정시작시간]' => 'LOAN_INFO__blank',
        //'[방문예정끝시간]'   => 'LOAN_INFO__blank',
        //'[방문예정주소]'    => 'visit__visit_addr',
        '[담당자]'          => 'branch__manager_name',
        '[담당자명]'        => 'branch__ceo_name',
        '[담당지점명]'      => 'branch__branch_name',
        '[담당지점전화번호]'=> 'branch__phone',
        '[담당지점팩스번호]'=> 'branch__fax',
        '[담당지점주소]'    => 'branch__addr',
        '[계약서발송주소]'  => 'LOAN_INFO__corp_addr',
        
        '[추심상태]' => 'LOAN_INFO__cancel_reason',          // 70,73번 문자
        '[보증인이름]' => 'LOAN_INFO__g_name',
    );


    /**
     * 요일
     *
     * @var array
     */
    public static $arrayWeekDay = Array(
        '1' => '월',
        '2' => '화',
        '3' => '수',
        '4' => '목',
        '5' => '금',
        '6' => '토',
        '0' => '일'
    );

    /**
     * 신규대출관리 상태 코드
     *
     * @var array
     */
    public static $arrayLoanAppStatus = Array(
        'Z' => '가접수',
        'A' => '접수',
        'B' => '심사',
        'C' => '1차결재',
        'D' => '고객확인',
        'E' => '2차결재',
        'F' => '대출대상',
        'Y' => '대출',
        'R' => '보류',
        'X' => '거절',
    );

    /**
     * 신규대출관리 보여줄 상태 코드
     *
     * @var array
     */
    public static $arrayLoanAppStatusView = Array(
        //'Z' => '가접수',
        'A' => '접수',
        'B' => '심사',
        'C' => '1차결재',
        'D' => '고객확인',
        'E' => '2차결재',
        'F' => '대출대상',
        'Y' => '대출',
        'R' => '보류',
        'X' => '거절',
    );

    /**
     * 신규대출관리 상태 코드 색상
     *
     * @var array
     */
    public static $arrayLoanAppStatusColor = Array(
        'Z' => '<span class="text-grey">가접수</span>',
        'A' => '<span class="text-green">접수</span>',
        'B' => '<span class="text-blue">심사</span>',
        'C' => '1차결재',
        'D' => '고객확인',
        'E' => '2차결재',
        'F' => '대출대상',
        'Y' => '대출',
        'R' => '보류',
        'X' => '<span class="text-red">거절</span>',
    );

    /* 
        YES or NO
    */
    public static $arrayYN = Array(
        'Y'=>'예', 
        'N'=>'아니오', 
    );

    /*
    입금상태
    */
    public static $arrayRefundStatus = Array( 
        "Y" => "<font color='blue'>입금</font>", 
        "F" => "<font color='green'>불명금</font>", 
        "T" => "입금처리전", 
        "N" => "<font color='orange'>미대상</font>"
    );

    /*
        VISIT 상태 배열 (방문상태)
    */
    public static $arrayVisitStatus = Array(
        'A' => '미실시',
        'O' => '자동수금',
        'V' => '방문수금',
        'M' => '방문미수금',
        'C' => '방문취소',
        // 'N' => '휴지통',
    );

    /*
        기한이익상실일 지정 사유코드
    */
    public static $arrayLoanLostDiv = Array(
        'T'=>"입금거래",            // 거래원장 kihan_date
        'L'=>"법착(확정일등록)",     // 법착 LOAN_INFO_LAW - 확정일 (law_confirm_date)
        'O'=>"법착(기각)",          // 법착 LOAN_INFO_LAW - 기각   (law_proc_status_cd=B3) >> 기각 = Overruled - 최하경대리가 알려 줌. 법정미드를 많이 봐서 안다고 하는데, 그게 더 신기ㅋ
        'I'=>"개인회생(폐지)",      // 개인회생 LOAN_IRL  - 폐지일 (irl_revoke_date)
        'C'=>"신용회복(실효)",      // 신용회복 LOAN_CCRS - 실효일 (cancel_date)
    );

    /*
        SMS 전송결과
    */
    public static $arraySmsStatus = Array(
        "0"     => "발송대기",
        "1"     => "결과수신대기",
        "2"     => "결과수신완료",
    );

    /*
        MMS 전송결과
    */
    public static $arrayMmsStatus = Array(
        "0"     => "전송대기",
        "2"     => "송신완료",
        "3"     => "결과수신",
    );

    /*
        FAX 발신상태
    */
    public static $arraySendStatus = Array(
        "0"     => "발송대기",
        "1"     => "발송중",
        "2"     => "발송완료",
    );

    /*
        CMS 등록여부
    */
    public static $arrayCmsRegFlag = Array(
        'A'=>'등록요청',
        'Y'=>'등록완료',
        'C'=>'해지요청',
        'X'=>'해지완료',
        'N'=>'등록실패'
    );

    /*
        민원 처리상태
    */
    public static $arrayComplainPrcStatus = Array(
        "A"     => "접수",
        "N"     => "처리중",
        "Y"     => "완료",
    );

    /*
        민원 조치결과
    */
    public static $arrayComplainResult = Array(
        "Y"     => "합의취하",
        "N"     => "합의불성립",
    );

    /*
        결재상태
    */
    public static $arrayConfirmStatus = Array(
        'A' => '결재요청',
        'B' => '1차결재',
        'C' => '2차결재',
        'Y' => '결재완료',
        'N' => '결재취소'
    );

    /*
        대출문서코드
    */
    public static $arrayLonDoc = Array(
        '2001001' => '주민등록등본',
        '2001002' => '주민등록초본',
        '2001003' => '신분증사본',
        '2002001' => '거래통장사본', 
        '2002002' => '사업자등록증사본', 
        '2002003' => '재직증명서',
        '2002004' => '건강보험증' , 
        '2002005' => '근로소득원천징수영수' , 
        '2003001' => '타사대출거래내역표' , 
        '2001004' => '재학증명서' , 
        '2001005' => '휴학증명서' , 
        '1002001' => '신용정보활용동의서' , 
        '1001001' => '약정서' , 
        '1002002' => '채권양도위임장' , 
        '2002006' => '소득증빙' , 
        '1002003' => 'CMS(신규)', 
        '1002004' => 'CMS(변경)', 
        '1001002' => '신탁서류' , 
        '1002005' => '대위변제서류' , 
        '1001003' => '조건변경서(원본)' , 
        '1001004' => '조건변경서(사본)' , 
        '1001005' => '상품설명서' , 
        '2004001' => '개인회생개시결정' , 
        '2099001' => '기타서류' , 
        '1001006' => '자필기재약정' , 
        '1001007' => '자필기재약정(보증)' , 
        '1001008' => '기한이익상실예정통지서' , 
        '1001009' => '자필기재(사본)',
        '1001010' => '자필기재(기한연장)' , 
        '1001011' => '자필기재(증액)' , 
        '2004002' => '집행권원' , 
        '3001001' => 'Agent' , 
        '1003001' => '안내장' , 
        '1003002' => '안내장(방문)' , 
        '1004001' => '독촉장(내용증명)' , 
        '1003003' => '채무조정안내문' , 
        '1004002' => '담보채권법적절차예정통지' , 
        '1004003' => '(계약서미회수)기한이익상실예정통지서' , 
        '1003004' => '상속절차이행 요청서' ,
        '1003005' => '상속절차 협조문' , 
        '1004004' => '법적절차착수통지서' , 
        '1003006' => '(신용)고소/고발통지서' , 
        '1003007' => '(담보)고소/고발통지서' , 
        '2001006' => '고객확인 수행결과서' , 
    );

    /*
        법원문서코드
    */
    public static $arrayCotDoc = Array(
        '4004001' => '배당표',
        '4004002' => '경매배당기일통지서',
        '4004003' => '매각기일 및 매각결정기일통지서',
        '4004004' => '최고서(배당요구종기)',
        '4004005' => '통지서(이중경매)',
        '4004006' => '통지서(무잉여)',
        '4004007' => '동산경매기일통지서',
        '4004008' => '사건처리촉구서',
        '4104001' => '개인회생 개시결정',
        '4104002' => '수정 채권자목록 및 변제계획안',
        '4104003' => '개인회생 금지/폐지/기각 결정',
        '4104004' => '미확정통지서',
        '4104005' => '파산선고',
        '4204001' => '전자소송 접수영수증',
        '4204002' => '전자소송 추납영수증',
        '4304001' => '송달료 납부서',
        '4204003' => '기타 영수증',
    );

    /*
        기타 문서
    */
    public static $arrayEtcDoc = Array(
        '9999999' => '기타 파일',
    );

    /*
        EDMS작업코드
    */
    public static $arrayEdmsJobCode = Array(
        '100' => '대출 계약 문서 스캔',
        '101' => '대출 담보물 문서 스캔',
        '102' => '대출 웹 팩스 연계',
        '103' => '대출 P2I 연계',
        '105' => '웹 페이지 파일등록',
        '150' => 'Agent 연계',
        '151' => 'MO 연계',
        '152' => 'N-SIC 연계',
        '200' => '송무 집행 문서 스캔',
    );


    /**
     * 심사표 컷오프 단계
     *
     * @var array
     */
    public static $arrayCutoffType = array(
        '01'=>'항목Cut-off1',
		'02'=>'등급Cut-off',
		'03'=>'항목Cut-off2',
    );

    /**
     * 심사표 신용대출 구분(코드변경금지)
     *
     * @var array
     */
    public static $arrayCssCredit = array(
        '111'=>'신규A남',
		'112'=>'신규A여',
		'121'=>'신규D남',
        '122'=>'신규D여',
        '131'=>'플랫폼',
        '211'=>'재대출',
        '311'=>'추가대출',
    );

    /**
     * 심사표 부동산 구분(코드변경금지)
     *
     * @var array
     */
    public static $arrayCssHouse = array(
        '01'=>'아파트담보',
		'02'=>'빌라담보',
    );

    /**
     * 심사표 차량 구분(코드변경금지)
     *
     * @var array
     */
    public static $arrayCssCar = array(
        '03'=>'차량담보',
		'04'=>'중고차구매',
    );
 
    /**
     * 지역구분
     *
     * @var array
     */
    public static $arrayLocal = array(
        '서울' => '서울',
        '부산' => '부산',
        '대구' => '대구',
        '인천' => '인천',
        '광주' => '광주',
        '대전' => '대전',
        '울산' => '울산',
        '세종' => '세종',
        '경기' => '경기',
        '강원' => '강원',
        '충북' => '충북',
        '충남' => '충남',
        '전북' => '전북',
        '전남' => '전남',
        '경북' => '경북',
        '경남' => '경남',
        '제주' => '제주',
    );

    /**
     * EDMS TaskName
     *
     * @var array
     */
    public static $arrayTaskName = array(
        'AGENT'          => '제휴사이미지',
        'SCAN'           => '계약서스캔',
        'DAMBO'          => '담보이미지',
        'LAW'            => '법착관련이미지',
        'DEPUTY'         => '채무자대리인이미지',
        'SELLER'         => '양도통지서',
        'SETTLE'         => '화해계약',
        'PAPER'          => '확약서스캔',
        'ETC'            => '기타'
    );

    /**
     * 투자자명세/상품내역 파일첨부 구분
     *
     * @var array
     */
    public static $arrayImageUploadDivision = array(
        'ContractPrint'            => '계약서출력',
        'ContractPrintExtension'   => '계약서출력(연장)',
        'CommitmentPrint'          => '확약서출력',
        'CommitmentPrintExtension' => '확약서출력(연장)',
        'ContractSend'             => '계약서발송',
        'CommitmentSend'           => '확약서발송',
        'ContractRetrieve'         => '계약서회수',
        'CommitmentRetrieve'       => '확약서회수',
        'ETC'                      => '기타'
    );

    /**
     * 투자자명세/상품내역 파일첨부 구분
     *
     * @var array
     */
    public static $arrayImageUploadDivisionSelect = array(
        'ContractSend'             => '계약서발송',
        'CommitmentSend'           => '확약서발송',
        'ContractRetrieve'         => '계약서회수',
        'CommitmentRetrieve'       => '확약서회수',
        'ETC'                      => '기타'
    );

    /**
     * EDMS TaskName
     *
     * @var array
     */
    public static $arrayLoanTaskName = array(
        'AGENT'          => '제휴사이미지',
        'SCAN'           => '계약서스캔',
        'DAMBO'          => '담보이미지',
        'LAW'            => '법착관련이미지',
        'ETC'            => '기타'
    );

    /**
     * EDMS TaskId
     *
     * @var array
     */
    public static function getTaskId() {
        return array(
            'LOAN'       => env('EDMS_LOAN_ID'),
            'COURT'      => env('EDMS_COURT_ID'),
            'ETC'        => env('EDMS_ETC_ID'),
            'SEPARATION' => env('EDMS_SEPARATION_ID'),
            'TEST'       => env('EDMS_TEST_ID'),
        );
    }

    /**
     * EDMS Search TaskId
     *
     * @var array
     */
    public static function getSearchTaskId() {
        return array(
            'LOAN'       => env('EDMS_LOAN_ID'),
            'COURT'      => env('EDMS_COURT_ID'),
            'ETC'        => env('EDMS_ETC_ID'),
        );
    }

    
    /**
     * EDMS 파일 저장경로
     *
     * @var array
     */
    public static function getSaveFolder() {
        return array(
            'LOAN'          => env('EDMS_LOAN_PATH'),
            'COURT'         => env('EDMS_COURT_PATH'),
            'ETC'           => env('EDMS_ETC_PATH'),
            'SEPARATION'    => env('EDMS_SEPARATION_PATH'),
            'TEST'          => env('EDMS_TEST_PATH'),
        );
    }

    /**
     * EDMS ECM_API 결과코드
     *
     * @var array
     */
    public static $arrayEcmResultCode = array(
        '0140' => '파일 복사 오류입니다',
        '0141' => '파일 이동 오류입니다',
        '0142' => '파일 삭제 오류입니다',
        '0160' => '파일 확장자 추출 오류입니다',
        '0202' => '지원하지 않는 확장자입니다',
        '0503' => '중복 오류입니다',
        '0703' => '물리 파일이 존재하지 않습니다',
        '0704' => '파일[mfileid]이 존재하지 않습니다',
        '0705' => '파일유형[확장자]이 존재하지 않습니다',
        '0721' => '실제 파일이 존재하지 않습니다',
        '0803' => '수정정보가 누락되었습니다',
        '0804' => '삭제정보가 누락되었습니다',
        '0806' => '처리 조건 정보가 누락되었습니다',
        '0811' => '업무 아이디[objTaskid]가 누락되었습니다',
        '0871' => '파일 아이디[mfileid]가 누락되었습니다',
        '0873' => '연계 아이디[linkid]가 누락되었습니다',
        '0891' => '대상 명칭[name]이 누락되었습니다. ',
        '0892' => '생성자[creator]가 누락되었습니다. ',
        '0000' => '성공',
        '9999' => '실패',
    );

    /**
     * 세틀뱅크 결과코드
     *
     * @var array
     */
    public static $arrayStebnkResultcode = Array(
        "0000" => "정상처리",
        "0001" => "전문형식불일치(미등록된 유형거래)",
        "0101" => "전문전송내역불일치(기존전송번호와 내용불일치)",
        "VTIM" => "세션타임아웃으로 이체거래시 확인필수.",
        "SSSS" => "업체번호 오류",
        "SB01" => "중복계좌(금액)출금오류",
        "SB02" => "1회 이체한도초과 오류",
        "SB03" => "1일 이체한도초과 오류",
        "SB04" => "기 환불발생 오류",
        "SB05" => "동의자료 구분 값 검증오류",
        "SB06" => "동의자료 대행생성기관 금결원 기관코드 미세팅",
        "SB07" => "세틀뱅크로 이체내역 없음(7000/100,7000/110)",
        "SB08" => "미등록 유형거래",
        "SB09" => "전문전송내역불일치(원전문과 내용 불일치)",
        "SB98" => "은행장애",
        "SB99" => "전체장애",
        "F003" => "전문송신기관 오류",
        "V141" => "기관시스템 장애",
        "V602" => "원거래전문관리번호 상이",
        "V142" => "기관미개시",
        "V603" => "원거래 취급일자 상이",
        "V150" => "미참가기관",
        "V604" => "원거래 계좌번호 상이",
        "V151" => "개설기관 서비스시간아님",
        "V605" => "원거래 거래금액 상이",
        "V210" => "거래일 부적당",
        "V606" => "원거래 기타사항 상이",
        "V303" => "업무구분코드오류",
        "V612" => "원거래 불명",
        "V304" => "은행코드 오류",
        "V637" => "취소불가, 취소거래불가기관",
        "V309" => "중복거래",
        "V682" => "입금기간만료",
        "V311" => "Timeover",
        "V683" => "입금기간만료",
        "V401" => "수취인계좌없음",
        "V712" => "거래코드오류",
        "V407" => "총 금액 상이",
        "V713" => "거래금액오류",
        "V410" => "이관계좌",
        "V755" => "비밀번호오류",
        "V411" => "해지계좌",
        "V779" => "이체거래불가계좌",
        "V413" => "기타수취불가",
        "V783" => "기타거래불가, 개설기관BUSY",
        "V416" => "불입횟수초과",
        "V785" => "기타거래불가",
        "V422" => "거래금액오류",
        "V801" => "취급기관오류",
        "V451" => "미적용업무",
        "V802" => "개설기관오류",
        "V503" => "수표금액 상이",
        "V816" => "해당계좌없음",
        "V818" => "기관코드오류",
        "V817" => "계좌오류",
        "V834" => "입출내역생성오류",
        "F004" => "REACTION 코드오류",
        "V835" => "집계원장갱신오류",
        "F005" => "연속거래번호 오류",
        "V840" => "집계정보오류",
        "F006" => "송수신 플래그오류",
        "V901" => "잔액부족",
        "F007" => "취급기관코드오류",
        "V999" => "기타거래불가",
        "F008" => "취급영업점코드 오류",
        "F009" => "취급단말코드 오류",
        "F001" => "전문길이 오류",
        "F010" => "매체구분오류",
        "F002" => "SYSTEM ID 오류",
        "F011" => "전문구분코드오류",
        "ZZZZ" => "리드코프내부오류" //커스텀 추가 
    );

    /**
     * 세틀뱅크 펌뱅킹 은행별 결과코드( 신한은행 )
     *
     * @var array
     */
    public static $arrayStebnkFirmcode = Array(
        "0000"=>"정상처리",
        "0111"=>"취급기관 SYSTEM 장애",
        "0413"=>"기타오류",
        "0890"=>"대외시스템에러",
        "111 "=>"타행 전산시스템 장애",
        "131 "=>"입금은행 보통예금계정 거래불가",
        "132 "=>"입금은행 저축예금계정 거래불가",
        "133 "=>"입금은행 자유저축예금계정 거래불가",
        "134 "=>"입금은행 가계당좌예금계정 거래불가",
        "135 "=>"입금은행 당좌예금계정 거래불가",
        "136 "=>"입금은행 기업자유예금계정 거래불가",
        "137 "=>"입금은행 별단예금계정 거래불가",
        "307 "=>"계좌번호 오류 (검증번호)",
        "310 "=>"상대은행 영업점 처리불가",
        "401 "=>"수취인계좌 없음",
        "402 "=>"수취인계좌 잔액증명서 발급계좌",
        "403 "=>"수취인계좌 무통장입금건수 초과",
        "404 "=>"수취인계좌 입금한도 초과",
        "405 "=>"수취인성명 오류",
        "406 "=>"전산시스템 오류 (금액검증부호)",
        "408 "=>"통장분실 재발행계좌",
        "409 "=>"법적제한 계좌",
        "410 "=>"이관계좌",
        "411 "=>"해약계좌",
        "412 "=>"잡좌편입계좌",
        "413 "=>"기타 수취불가",
        "415 "=>"불입금 상이(1회 불임금 있는 경우)",
        "434 "=>"가상계좌 입금가능시간 오류",
        "U004"=>"관련업무 아님",
        "U101"=>"해당 업체코드 없음",
        "U103"=>"처리일자 오류",
        "U107"=>"전문코드/업무구분 오류",
        "U109"=>"전문번호 중복",
        "U112"=>"해당 전문번호 없음",
        "U113"=>"당일자 환율 미고시",
        "U114"=>"개시전문 수신전 상태",
        "U115"=>"해당회차 환율 미고시",
        "U116"=>"환율고시중입니다.",
        "U119"=>"계좌번호 불일치",
        "U198"=>"기타 에러",
        "U199"=>"시스템 에라",
        "U201"=>"지급계좌 미등록상태",
        "U211"=>"해당계좌 없음",
        "U212"=>"지급계좌 오류",
        "U213"=>"결제구분 오류",
        "U214"=>"전자어음번호 오류 (반드시 10자리)",
        "U216"=>"입금계좌 오류",
        "U217"=>"전자어음 관리번호 오류?",
        "U218"=>"정상취소된 거래",
        "U219"=>"기취소 거래 오류",
        "U220"=>"거래금액확인",
        "U221"=>"자금이체 업무마감",
        "U222"=>"에스모아포인트통장으로 입출금불가",
        "U228"=>"해당내용 없음",
        "U234"=>"비실명 계좌",
        "U235"=>"실명번호 불일치",
        "U236"=>"복기부호 오류",
        "U237"=>"약정신청 중복오류(결제원2005와동일)",
        "U238"=>"약정신청 미등록 해지요청",
        "U239"=>"미신청계좌입니다",
        "U240"=>"약정해지상태입니다",
        "U241"=>"영업점 해지 재신청 불가",
        "U242"=>"납부자번호 오류(자동이체 신청)",
        "U243"=>"자동이체신청 불가(익영업일신청)",
        "U244"=>"계좌오류(계좌가 평생계좌/포인트계좌/적금계좌 등)",
        "U301"=>"폐쇄점 계좌 거래불가",
        "U302"=>"입금액이 입금한도액 초과",
        "U304"=>"입금거래가 불가능합니다",
        "U305"=>"1종 사고계좌 (파산)",
        "U307"=>"해당 계좌점 마감",
        "U308"=>"계좌번호 확인 (계좌번호 불일치)",
        "U309"=>"계좌번호 확인 (해지, 미등록)",
        "U311"=>"해지,이관,잡좌,잡수입계좌",
        "U314"=>"이자조회필 계좌, 계좌점에 문의요망",
        "U315"=>"실명번호 오류",
        "U319"=>"1종 사고계좌 (입지정지)",
        "U320"=>"1종 사고계좌 (잔액증명 발급)",
        "U321"=>"2종 사고계좌 (범인사고 등록)",
        "U322"=>"1종 사고계좌 (적수변경 대상)",
        "U323"=>"1종 사고계좌 (기타)",
        "U324"=>"2종 사고계좌 (인감사고)",
        "U325"=>"2종 사고계좌 (통장사고)",
        "U326"=>"2종 사고계좌 (압류사고)",
        "U327"=>"2종 사고계좌 (법적수속)",
        "U328"=>"2종 사고계좌 (지급정지)",
        "U329"=>"2종 사고계좌 (3차 부도)",
        "U330"=>"2종 사고계좌 (거래해지등록)",
        "U331"=>"CENTER 계좌에 대한 거래불가",
        "U332"=>"거래금액 불일치",
        "U335"=>"통장비밀번호 불일치",
        "U337"=>"세종증권 폐쇄계좌",
        "U338"=>"이미 존재하는 가상계좌 번호",
        "U341"=>"SYSTEM ERR 원장상 계좌번호불일치",
        "U342"=>"연체상태, 지급거래 불가",
        "U343"=>"지급금액이 지불가능금액 초과",
        "U344"=>"1종 사고계좌 (본인사망)",
        "U345"=>"1종 사고계좌 (입지정지)",
        "U346"=>"1종 사고계좌 (잔액증명 발급)",
        "U347"=>"1종 사고계좌 (범인사고등록)",
        "U348"=>"1종 사고계좌 (적수변경대상)",
        "U349"=>"2종 사고계좌 (인감사고)",
        "U350"=>"2종 사고계좌 (통장사고)",
        "U351"=>"2종 사고계좌 (압류사고)",
        "U352"=>"2종 사고계좌 (법적수속)",
        "U353"=>"2종 사고계좌 (지급정지)",
        "U354"=>"2종 사고계좌 (3차 부도)",
        "U355"=>"2종 사고계좌 (거래해지등록)",
        "U356"=>"이체금액 초과",
        "U357"=>"은행코드와 계좌번호체계 불일치",
        "U358"=>"당,타지 구분오류",
        "U359"=>"타행환 미실시 은행",
        "U360"=>"타행환 LOCK",
        "U361"=>"입금인성명 오류 (특수문자)",
        "U362"=>"입금은행 코드틀림",
        "U363"=>"입금은행 업무장애",
        "U364"=>"입금인번호 입력하세요",
        "U365"=>"입금인번호 오류입니다",
        "U366"=>"출금제한(300만원 이상 입금 10분이내)",
        "U371"=>"이체비밀번호 1회오류",
        "U372"=>"이체비밀번호 2회오류",
        "U373"=>"이체비밀번호 3회오류",
        "U374"=>"이체비밀번호 4회오류",
        "U375"=>"이체비밀번호 5회오류",
        "U381"=>"하위이용기관코드미등록",
        "U392"=>"금융거래한도계좌 1일 인출/이체한도(200만원)초과",
        "U393"=>"금융거래한도계좌 1일 인출/이체한도(30만원)초과",
        "U401"=>"구매회사원장 없음",
        "U402"=>"판매회사원장 없음",
        "U403"=>"구매회사 미등록상태",
        "U404"=>"판매회사번호 오류",
        "U405"=>"채권만기지급일 오류 (당일)",
        "U406"=>"채권금액 오류",
        "U407"=>"채권종류 오류",
        "U408"=>"채권번호 오류",
        "U409"=>"판매회사원장 오류",
        "U410"=>"사업자번호 오류",
        "U411"=>"사업자번호 불일치",
        "U412"=>"채권인출가능일 오류",
        "U413"=>"채권납품일자 오류",
        "U414"=>"채권품목 오류",
        "U415"=>"지급사업장 오류",
        "U416"=>"채권결제계좌번호 불일치",
        "U417"=>"채권번호 중복",
        "U418"=>"구매회사 해지상태",
        "U419"=>"구매회사 총여신한도 초과",
        "U420"=>"구매회사 대출 약정 만기일 경과",
        "U451"=>"이체일자 오류",
        "U452"=>"환매불가",
        "U453"=>"사업자번호 오류",
        "U454"=>"가맹점번호 오류",
        "U455"=>"계좌번호 오류",
        "U456"=>"금액 오류 (금액",
        "U457"=>"결제일자 오류",
        "U458"=>"할부기간 오류 (MAX : 36개월)",
        "U459"=>"카드번호 오류",
        "U460"=>"약정한도 초과",
        "U461"=>"매출번호(승인번호)오류",
        "U462"=>"회원연체 상태",
        "U463"=>"취소불가 (기거래)",
        "U464"=>"연장일자 오류",
        "U465"=>"연장불가 (원장오류)",
        "U466"=>"취소 금액 불일치",
        "U467"=>"할인 실행 완료 (기실행거래)",
        "U468"=>"대출 약정 미등록",
        "U502"=>"비밀번호 오류",
        "U503"=>"비밀번호 3회오류",
        "U504"=>"미교부카드",
        "U509"=>"이체한도초과",
        "U716"=>"별단정산금액상이(파일과전문금액불일치)",
        "U800"=>"고객확인의무(CDD/EDD) 수행대상고객",
        "U801"=>"기관코드 미입력",
        "U802"=>"지급계좌번호 미입력",
        "U803"=>"예금주명 미입력",
        "U815"=>"지급계좌번호 오류",
        "U817"=>"외국인 거래 불가",
        "U819"=>"미성년 거래 불가",
        "U820"=>"생년월일 미등록 고객",
        "U821"=>"실명번호 불일치(생년월일+성별)",
        "U822"=>"지급은행코드 미입력",
        "U823"=>"지급은행코드 오류(당행만 가능)",
        "U824"=>"법인사업자 거래 불가",
        "U825"=>"고객 연락처 정보 미등록(은행)",
        "U827"=>"고객 휴대폰 정보 미등록(은행)",
        "U828"=>"고객 휴대폰 번호 불일치",
        "U829"=>"지급계좌번호 기존재(1인 1계좌)",
        "U830"=>"가상통화 거래 불가 고객",
        "U900"=>"해당증권사 시스템장애",
        "U901"=>"증권전산 시스템장애",
        "U999"=>"시스템 BUSY"
    );


   /**
     * 부서 지점 센터 코드
     *
     * @var array
     */
    public static $arrayBranchCenterCode = Array(
        '1'=>'회수센터'
    );


    /**
     *  일반 회계계정설정을 위한 배열
     */
    public static $arrayDouzoneAcctkey = Array
    (
        "OVER" => "가수금",
        "PROF" => "잡이익",
        "LOSS" => "대손충당금(신용)",
        "LOSD" => "대손충당금(담보)",
        "BANK" => "보통예금",
        "CASH" => "현금",
        "ISSU" => "증명발급비",
        "CARD" => "법인카드/미지급금",      // 법비용 등록 할 때

        "RFEE" => "송금의뢰/지급수수료",
        "SFEE" => "송금추심/지급수수료",

        // 법조치비용관련 - 2021.05.14일 신소비자시스템 법조치 계정관련 수정요청 메일에 정의된 코드대로 설정 (없으면 자동전표 대상 아님)
        "COST_A1"    => "지급명령/법적조치",
        "COST_A2"    => "소액재판/법적조치",
        "COST_B1-B6" => "가압류/민사신청",
        "COST_C1"    => "동산압류/민사집행",
        "COST_C2-C7" => "채권압류/민사집행",   // C2~C7
        "COST_C8"    => "재산명시/민사집행",
        "COST_C9"    => "채불자등재/민사집행",
        "COST_C10"   => "재산조회/민사집행",
        "COST_C11"   => "동산압류/민사집행",
        "COST_C12"   => "기타/민사집행",
        "COST_D1"    => "자동차경매/민사집행",
        "COST_D2"    => "부동산경매/민사집행",

        "DSET" => "근저당권설정비용",

        // 월 결산전표
        "LMIS" => "대출채권/미수수익",
        "DMIS" => "연체대출채권/미수수익",

    );
    /**
     *  일반 회계 관련업무 코드
     */
    public static $arrayDouzoneTradeGubun = Array
    (
        "O"    => "출금등록",
        "I"    => "입금등록",
        "C"    => "법비용발생",
        "U"    => "미처리입금",
        "ISSU" => "증명발급",
        "SANG" => "상각",           // 대손충당금
        "SELL" => "매각",           // 
        "RFEE" => "송금의뢰",       // 송금의뢰/지급수수료
        "SFEE" => "송금추심",       // 송금추심/지급수수료

        // 아직안만듬
        "TRAN" => "지점이수관",
        "MISU" => "미수수익결산",   // 대출채권/미수수익, 연체대출채권/미수수익
    );
    /**
     *  법조치 비용 종류코드
     */
    public static $arrayDouzoneCostDetails= Array
    (
        "postage_am"   => "001_송달료",
        "stamptax_am"  => "002_인지세",
        "certitax_am"  => "003_증지세",
        "registtax_am" => "004_등록세",
        "insurance_am" => "005_보증보험증권료",
        "auction_am"   => "006_경매예납금",
        "charge_am"    => "007_수수료",
        "deposit_am"   => "008_공탁금",
        "etc_am"       => "999_기타"
    );
    
    /**
     * 상환 입금 방법
     *
     * @var array
     */
    public static $arrayReturnInMethod = Array(
        'V' => '가상계좌',
        'C' => 'CMS',
    );

    /*
        분리보관열람결재상태
    */
    public static $arrayArchiveStatus = Array(
        'A' => '결재요청',
        'B' => '1차결재',
        'C' => '2차결재',
        'Y' => '결재완료',
        'N' => '결재취소',
        'D' => '열람기간종료'
    );
    
    /**
     * 거래구분
     */
    public static $arrayTradeDiv = Array(
        'O'=>'출금', 
        'I'=>'입금', 
        'P'=>'비용'
     );

    /**
     * 대출구분코드
     */
    public static $arrayTmLoanDiv = Array(
        '01'=>'추가대출',
        '02'=>'재대출',
        '99'=>'한도내증액'
     );

     /**
     * 대출구분코드(out)
     */
    public static $arrayOutDiv = Array(
        '1'=>'대출금',
        '2'=>'가수금송금',
        '3'=>'가수금잡이익'
     );

    /**
     * 대출구분 세부코드(out)
     */
    public static $arrayOutSubDiv = Array(
        '11'=>'신규', 
        '21'=>'재계약', 
        '31'=>'추가', 
        '41'=>'재대출', 
        '61'=>'매입'
     );

    /**
     * 문제제한코드
     */
    public static $arraySmsLmtCd = Array(
        'Y1'=>'당일 1회',
        'Y2'=>'전일 1회',
    );

    /**
     * 미완료리스트 미완료 구분
     */
    public static $arrYetListRes2 = Array(
        '100'=>'컷오프탈락',
        '200'=>'전화끊어짐',
        '300'=>'보류',
        '400'=>'기타',
        '500'=>'개인정보동의'
    );

    /**
     * 원장변경이력 작업 구분
     */
    public static $arrayWonjangHisCd = Array(
        'A' => '가상계좌번호변경(발급)',
        'B' => '가상계좌번호변경(해지)',
        'C' => '거래취소',
        'D' => '고객명변경',
        'E' => '금리변경(정상)',
        'F' => '금리변경(연체)',
        'G' => '대출송금액변경(등록)',
        'H' => '대출송금액변경(취소)',
        'I' => '약정일변경',
        'J' => '일괄금리인하(정상)',
        'K' => '일괄금리인하(연체)',
        'L' => '납입예정일변경',
        'M' => '납입예정금액변경',
        'N' => '상환방법변경',
        'O' => '회수순서변경',
        'P' => '무이자변경등록',
        'Q' => '대출지급계좌변경',
        'R' => '중도상환수수료면제',
    );

    /**
     * 접촉금지 연체사유코드
     */

    // 18	개인회생신청	    // 개인회생신청
    // 19	개인회생금지결정	// 개인회생금지결정
    // 20	개인회생개시결정	// 개인회생개시결정
    // 21	개인회생인가	    // 개인회생인가
    // 22	파산신청	        // 파산신청
    // 24	파산면책결정	    // 파산면책결정
    // 28	신복위신청	        // 신복위신청
    // 43	신복위인가	        // 신복위인가
    // 44	신복위인가금연체	 // 신복위인가금연체
    // 31	담보대출/개인회생	 // 담보대출개인회생
    // 32	담보대출/파산	    // 담보대출파산
    // 37	대리인선임	        // 대리인선임
    // 38	개인회생인가금연체	 // 개인회생인가금연체
    // 40	자료송부서	        // 자료송부서
    // 41	개인회생항고	    // 개인회생항고
    // 42	파산항고	        // 파산항고

    // 개인회생신청-구
    // 개인회생(법원연체)-구
    // 파산신청-구
    // 파산결정

    // 25	개인회생연체		??
    // 34	개인회생기각		??
    // 35	개인회생폐지		??
    // 36	신복위실효			??
    // 39	파산기각			??    
    public static $arrBanAttDelayCd = Array(
        '09','10','11',
        '18','19','20','21','22','23','24','25','28','43','44','31','32','37','38','40','41','42'
    );

    /**
     * 승인권한배열
     */
    public static $arrConfirmPermit = Array(
        'A101',
        'A201',
        'A102',
        'A202',
        'A103',
        'A203',
        'A104',
        'A105',
        'A205',
        'A106',
        'A206',
        'A107',
        'A207',
        'A108',
        'A208',
        'A109',
        'A209',
        'A110',
        'A210',
        'A111',
        'A112',
        'A212',
        'A113',
        'A213',
        'A114',
        'A214',
        'A115',
        'A215',
        'A116',
        'A216',
        'A117',
        'A118',
        'A119',
        'A120',
        'A121',
        'A221',
        'A122',
        'A222',
        'A123',
        'A223',
        'A124',
        'A224',
        'A125',
        'A225',
        'A126',
        'A127',
        'A128',
        'A129',
        'A229',
        'A130',
        'A230',
        'A131',
        'A231',
        'A132',
        'A133',
        'A134',
        'A135',
        'A136',
        'A236',
        'A137',
        'A140',
        'A141',
        'A241',
        'A142',
        'A242',
        'A143',
        'A144',
        'A145',
        'A245',
        'A146',
        'A246',
        'A149',
        "A213",
        "A214",
        "A215",
        "A216",
        "A222",
        "A301",
        "A302",
        "A303",
        "A305",
        "A306",
        "A307",
        "A308",
        "A309",
        "A322",
        "A324",
        "A325",
        "A329",
        "A331",
        "A346",
        "A403",
        "A405",
        // "A406",
        // "A407",
        "A424",
        "A425",
        "A429",
        "A446",
    );    

    /**
     * 승인권한 중 지역장(E031),센터장(E032),본부장(E033) 권한을 갖고있는지 추가로 체크가 필요한 애들임
     * 1 : 지역장권한 있어야함
     * 2 : 센터장권한 있어야함
     * 3 : 본부장권한 있어야함
     */
    public static $arrConfirmPermitchk = Array(
        "A213"=>"1",
        "A214"=>"1",
        "A215"=>"1",
        "A216"=>"1",
        "A222"=>"2",
        "A301"=>"1",
        "A302"=>"2",
        "A303"=>"2",
        "A305"=>"2",
        "A306"=>"2",
        "A307"=>"2",
        "A308"=>"1",
        "A309"=>"1",
        "A322"=>"3",
        "A324"=>"2",
        "A325"=>"2",
        // "A329"=>"2",
        "A331"=>"1",
        "A346"=>"2",
        "A403"=>"3",
        "A405"=>"3",
        // 화해최종권한"A406"=>"3",
        // "A407"=>"3",
        "A424"=>"3",
        "A425"=>"3",
        "A429"=>"3",
        "A446"=>"3",
    );

    public static $ArrAmlRiskCust = array("A"=>"접수","B"=>"1차확인","C"=>"2차확인","D"=>"최종확인");
    /**
     * 채무조정(회파복)명세 구분
     */
    public static $arrayReliefDiv   = array("A"=>"회생/파산","B"=>"신용회복");
    
    /**
     * 채무조정(회파복)명세 유형
     */
    public static $arrayReliefSubDiv = array("A"=>Array("A1"=>"개인회생", "A2"=>"파산", "A3"=>"면책", "A4"=>"항고", "A9"=>"기타"), "B"=>Array("B1"=>"개인워크아웃","B2"=>"프리워크아웃","B3"=>"신속채무조정","B4"=>"수정조정"));

    /**
     * 채무조정(회파복)명세 유형별 사건번호
     */
    public static $arrayReliefEventCd = array("A1"=>array("개회"=>"개회","회합"=>"회합","회단"=>"회단","간회단"=>"간회단","간회합"=>"간회합"),"A2"=>array("하단"=>"하단"),"A3"=>array("하면"=>"하면"),"A4"=>array("라"=>"라"));

    /**
     * 나의사건조회 조회구분
     */
    public static $arrayNsfDiv = array("I"=>"회생/파산","S"=>"개회","L"=>"법착");


    /**
     * 쿠콘연동 전문구분
     */
    public static $arrayCooconTradeDiv = array(
        "101"=>"대출금리한도 조회",
        "102"=>"대출금리한도 조회결과 통지",
        "103"=>"대출신청접수",
        "104"=>"대출실행결과통보",
        "105"=>"대출대출실행결과확인",
        "106"=>"대출취소",
        "991"=>"System Health Check",
    );

    /**
     * 쿠콘연동 전문유형
     */
    public static $arrayCooconTradeType = array("0400"=>"요청", "0410"=>"응답",);

    /**
     * 쿠콘연동 결과코드
     */
    public static $arrayCooconResCode = array(
        "0000"=>"정상",
        "B000"=>"필수입력항목이 누락",
        "B001"=>"이미 존재하는 대출신청관리번호",
        "B002"=>"고객요청 신용정보조회 차단상태로 CB 정보 조회가 불가",
        "B003"=>"금리한도조회 불가",
        "B004"=>"접수 불가",
        "B005"=>"제휴사관리번호 미존재",
        "B006"=>"미정의 코드",
        "B601"=>"이미 거절 처리된 거래",
        "B602"=>"이미 실행된 거래",
        "B999"=>"기타 업무 오류입니다.",
        "0101"=>"참가기관 장애",
        "0102"=>"중계 VAN SYSTEM 장애",
        "0103"=>"전문길이 오류",
        "0104"=>"업무구분코드 오류",
        "0105"=>"전문종별코드 오류",
        "0106"=>"거래구분코드 오류",
        "0107"=>"송수신 FLAG 오류",
        "0108"=>"거래일련번호 중복 오류",
        "0991"=>"비정상오류로 인한 참가기관 문의바람",
        "0992"=>"비정상오류로 인한 참가기관 문의바람",
        "0210"=>"기타오류",
        "9991"=>"시스템점검중입니다.",
        "0206"=>"거래없음",
    );

    /**
     * 쿠콘연동 진행상태
     */
    public static $arrayCooconStatus = array(
        "A" => "한도조회접수",
        "B" => "한도조회완료",
        "C" => "한도조회결과통지",
        "D" => "대출신청접수",
    );

    /**
     * 쿠콘연동 진행상태결과
     */
    public static $arrayCooconResultCode = array(
        "1" => "승인",
        "2" => "한도 산출중",
        "3" => "부결",
        "4" => "오류",
    );

    /**
     * 인쇄양식 - ERP
     */
    public static $arrayPaperForm = array(
    );

    /**
     * -미사용-
     * 인쇄양식 - UPS
     */
    public static $arrayUPSPaperForm = array(
        "100101" => "제휴사 이력제",
        "100102" => "적법수집 확인서"
    );

    /**
     * 일괄처리로그 진행상태 
     */
    public static $arrayLumpLogStatus = array(
        "W" => "대기",
        "P" => "진행",
        "C" => "완료",
        "X" => "실패",
        "E" => "오류",
    );

    /**
     * 일괄처리로그 배치구분
     */
    public static $arrayLumpLogDivision = array(
        // "CONVERT" => "기관차입일괄등록배치",
        "PLAN" => "상환스케줄일괄수정배치",
    );

    /**
     * 일괄처리로그 팝업리스트
     */
    public static $arrayLumpLogPopList = array(
        // "CONVERT" => "기관차입일괄등록배치",
        "PLAN" => "상환스케줄일괄수정배치",
    );

    /**
     * 고객정보변경내역 검색상세기준
     */
    public static $arrayCustInfoChangeList = array(
        "name"=>"이름",
        "ssn"=>"주민등록번호",
        "relation"=>"관계",
        "email"=>"이메일",
        "com_ssn"=>"사업자번호",
        "ph11"=>"전화번호",
        "bank11"=>"은행/계좌번호",         
        "addr11"=>"주소",
        "memo"=>"메모",
    );

    /**
     * 투자자정보변경내역 검색상세기준
     */
    public static $arrayInvestorChangeList = array(
        "relation"=>"관계",
        "email"=>"이메일",
        "com_ssn"=>"사업자번호",
        "ph11"=>"전화번호1",
        "ph21"=>"전화번호2",
        "ph41"=>"전화번호3",
        "bank11"=>"은행/계좌번호1",
        "bank21"=>"은행/계좌번호2",
        "bank31"=>"은행/계좌번호3",            
        "addr11"=>"주소1",
        "addr21"=>"주소2",
        "memo"=>"메모",         
    );

    /**
     * 채권정보변경내역 검색상세기준
     */
    public static $arrayLoanInfoChangeList = array(
        "loan_rate"=>"금리",
        "contract_day"=>"약정일",
        "contract_date"=>"계약일",
        "contract_end_date"=>"만기일",
        "status"=>"상태",
    );

    /**
     * 투자정보변경내역 검색상세기준
     */
    public static $arrayInvestmentChangeList = array(
        "loan_rate"=>"수익률",
        "contract_day"=>"약정일",
        "contract_date"=>"계약일",
        "contract_end_date"=>"만기일",
        "status"=>"상태",
    );

    /**
     * 고객구분
     */
    public static $array_com_div = Array("A"=>"개인", "B"=>"법인");

    // 엑셀 다운로그 상태
    public static $arrExcelDownStatus = Array("S"=>"대기", "A"=>"진행", "D"=>"완료", "E"=>"바로실행", "F"=>"실패");
    
    // 입금구분
    public static $arrayProcess = array(
        "추가" => "A", 
        "수정" => "U", 
        "삭제" => "D", 
        "손실" => "L1",
    );

    // 거래원장 입금구분
    public static $arrayTradeType = array(
        "01"=>"정상입금", 
        "02"=>"화해감면입금", 
        "03"=>"일반감면입금", 
        "04"=>"상각입금", 
        "05"=>"선취수수료상환", 
        "06"=>"정상입금(중도상환)", 
        "07"=>"매각", 
        "08"=>"개인회생", 
        "09"=>"신용회복", 
    );

    /**
     * 전산요청 상태
     *
     * @var array
     */
    public static $arrComrequestBoardStatus = Array(
        'A' => '요청',
        'C' => '검수',
        'Y' => '완료',
    );
    
    /* KSNET 은행 응답 코드 */
    public static $array_ksnet_answer_code = Array(
        'SHINHAN' => array(
            '111'  => '은행센터의 SYSTEM 장애',
            '112'  => '은행센터의 타행환 취급 개시 시간 이전',
            '113'  => '은행센터의 타행환 종료',
            '121'  => '중계센터의 SYSTEM 장애',
            '122'  => '중계센터의 타행환 취급 개시 시간 이전',
            '123'  => '중계센터의 타행환 종료',
            '131'  => '해당은행 보통 계정 처리 불가',
            '132'  => '해당은행 저축 계정 처리 불가',
            '133'  => '해당은행 자유저축 계정 처리 불가',
            '134'  => '해당은행 가계종합 계정 처리 불가',
            '135'  => '해당은행 당좌 계정 처리 불가',
            '136'  => '해당은행 기업자유저축 계정 처리 불가',
            '137'  => '해당은행 별단 계정 처리 불가',
            '138'  => '중계센터 DATA BASE 장애',
            '141'  => '해당은행 SYSTEM DOWN',
            '142'  => '전 LINE 장애',
            '143'  => 'LOGICAL CHANNEL장애',
            '144'  => '해당은행 적금 계정 처리 불가',
            '145'  => '해당은행 신탁 계정 처리 불가',
            '288'  => '전문 LENGTH ERROR',
            '299'  => '전문 TYPE ERROR',
            '301'  => 'SYSTEM - ID 오류',
            '302'  => 'MESSAGE 코드 오류',
            '303'  => '업무구분 코드 오류',
            '304'  => '은행 코드 오류',
            '305'  => '지점 코드 오류',
            '306'  => 'ERROR/RESPONSE코드 오류',
            '307'  => 'CHECK DIGIT ERROR',
            '308'  => '계좌번호 상위',
            '309'  => '이중 거래임',
            '310'  => '해당지점 처리 불가',
            '311'  => 'TIME OVER (응답대기시간 경과)',
            '312'  => '과목코드 ERROR',
            '401'  => '수취인 계좌 없음',
            '402'  => '수취인 계좌 잔액증명서 발부',
            '403'  => '수취인 통장 정리후 거래 가능',
            '404'  => '수취인 입금 한도 초과',
            '405'  => '수취인 성명 오류',
            '406'  => '금액검증부호 오류',
            '407'  => '총금액 상위',
            '408'  => '통장 분실 재발행계좌',
            '409'  => '법적 제한 계좌',
            '410'  => '이관 계좌',
            '411'  => '해약 계좌',
            '412'  => '잡좌',
            '413'  => '기타 수취 불가 (해당 개설점 연락)',
            '414'  => '추심대전 수수료 상위',
            '2XX'  => '전문 FORMAT FIELD ERROR(xx:FIELD NO.)',
            '0000' => '정상처리',
            'U004' => '관련업무 아님',
            'U101' => '해당 업체코드 없음',
            'U103' => '처리일자 오류',
            'U107' => '전문코드/업무구분 오류',
            'U109' => '전문번호 중복',
            'U111' => '미사용',
            'U112' => '미사용',
            'U113' => '당일자 환율 미고시',
            'U114' => '개시전문 수신전 상태',
            'U115' => '해당회차 환율 미고시',
            'U116' => '환율고시중입니다',
            'U119' => '미사용',
            'U121' => '미사용',
            'U122' => '미사용',
            'U197' => '미사용',
            'U198' => '기타 오류',
            'U199' => '시스템 에러(입금은행)',
            'U201' => '지급계좌 미등록상태',
            'U211' => '해당계좌 없음',
            'U212' => '지급계좌 오류',
            'U213' => '결제구분 오류',
            'U214' => '전자어음번호 오류 (반드시 10자리)',
            'U216' => '입금계좌 오류 ',
            'U217' => '전자어음 관리번호 오류',
            'U219' => '원거래 취소상태',
            'U220' => '거래금액 확인 (금액이 0원)',
            'U221' => '자금이체 업무마감',
            'U222' => '미사용',
            'U228' => '해당내용 없음',
            'U234' => '비실명 계좌',
            'U235' => '실명번호 불일치',
            'U236' => '복기부호 오류',
            'U237' => '자동이체신청 중복 오류',
            'U238' => '자동이체 미신청 해지',
            'U239' => '자동이체미신청 계좌',
            'U240' => '자동이체 신청해지 상태',
            'U241' => '자동이체신청 불가 (영업점해지)',
            'U242' => '납부자번호 오류 (자동이체 신청)',
            'U243' => '자동이체신청 불가 (익영업일신청)',
            'U244' => '포인트 통장이나 적금, 평생계좌번호 등으로 계좌 등록오류',
            'U301' => '폐쇄점 계좌 거래불가',
            'U302' => '거래금액 확인 (입금한도, 최저금액등)',
            'U304' => '입금거래가 불가 계좌',
            'U305' => '1종 사고계좌 (파산)',
            'U307' => '입금거래 불가 (마감, 수납기관경과등)',
            'U308' => '비실명 계좌',
            'U309' => '계좌번호 확인 (해지, 미등록)',
            'U310' => '미사용',
            'U311' => '해지,이관,잡좌,잡수입계좌',
            'U314' => '미사용',
            'U315' => '실명번호 오류',
            'U319' => '1종 사고계좌 (입지정지)',
            'U320' => '1종 사고계좌 (잔액증명 발급)',
            'U321' => '2종 사고계좌 (범인사고 등록)',
            'U322' => '1종 사고계좌 (적수변경 대상)',
            'U323' => '1종 사고계좌 (기타)',
            'U324' => '2종 사고계좌 (인감사고)',
            'U325' => '2종 사고계좌 (통장사고)',
            'U326' => '2종 사고계좌 (압류사고)',
            'U327' => '2종 사고계좌 (법적수속)',
            'U328' => '2종 사고계좌 (지급정지)',
            'U329' => '2종 사고계좌 (3차 부도)',
            'U330' => '2종 사고계좌 (거래해지등록)',
            'U331' => '미사용',
            'U332' => '거래금액 확인 (입금한도, 최저금액등)',
            'U333' => '미사용',
            'U334' => '미사용',
            'U335' => '계좌비밀번호 불일치',
            'U337' => '미사용',
            'U338' => '이미 존재하는 가상계좌번호',
            'U339' => '미사용',
            'U340' => '미사용',
            'U341' => '미사용',
            'U342' => '연체상태, 지급거래 불가',
            'U343' => '지급금액이 지불가능금액 초과',
            'U344' => '1종 사고계좌 (본인사망)',
            'U345' => '1종 사고계좌 (입지정지)',
            'U346' => '1종 사고계좌 (잔액증명 발급)',
            'U347' => '1종 사고계좌 (범인사고등록)',
            'U348' => '1종 사고계좌 (적수변경대상)',
            'U349' => '2종 사고계좌 (인감사고)',
            'U350' => '2종 사고계좌 (통장사고)',
            'U351' => '2종 사고계좌 (압류사고)',
            'U352' => '2종 사고계좌 (법적수속)',
            'U353' => '2종 사고계좌 (지급정지)',
            'U354' => '2종 사고계좌 (3차 부도)',
            'U355' => '2종 사고계좌 (거래해지등록)',
            'U356' => '이체금액 초과',
            'U357' => '미사용',
            'U358' => '미사용',
            'U359' => '미참가 은행',
            'U360' => '미사용',
            'U361' => '입금인성명 오류 (특수문자)',
            'U362' => '입금은행 코드 오류',
            'U363' => '개설은행 장애 (입금은행, 입금기관)',
            'U364' => '입금인번호 미입력(입금인번호 필수계좌)',
            'U365' => '입금인번호 오류',
            'U366' => '미사용',
            'U367' => '미사용',
            'U368' => '미사용',
            'U369' => '미사용',
            'U370' => '미사용',
            'U371' => '미사용',
            'U372' => '미사용',
            'U373' => '미사용',
            'U375' => '미사용',
            'U377' => '미사용',
            'U378' => '미사용',
            'U379' => '미사용',
            'U381' => '미사용',
            'U385' => '미사용',
            'U386' => '미사용',
            'U387' => '미사용',
            'U388' => '미사용',
            'U389' => '미사용',
            'U393' => '미사용',
            'U397' => '미사용',
            'U398' => '미사용',
            'U401' => '구매회사원장 없음',
            'U402' => '판매회사원장 없음',
            'U403' => '구매회사 미등록상태',
            'U404' => '판매회사번호 오류',
            'U405' => '채권만기지급일 오류 (당일)',
            'U406' => '채권금액 오류',
            'U407' => '채권종류 오류',
            'U408' => '채권번호 오류',
            'U409' => '판매회사원장 오류',
            'U410' => '사업자번호 오류',
            'U411' => '사업자번호 불일치',
            'U412' => '채권인출가능일 오류',
            'U413' => '채권납품일자 오류',
            'U414' => '채권품목 오류',
            'U415' => '지급사업장 오류 ',
            'U416' => '채권결제계좌번호 불일치',
            'U417' => '채권번호 중복',
            'U418' => '구매회사 해지상태',
            'U419' => '구매회사 총여신한도 초과',
            'U420' => '대출약정 만기일 경과',
            'U421' => '미사용',
            'U422' => '2차구매자번호 입력하세요',
            'U451' => '이체일자 오류',
            'U452' => '환매불가',
            'U453' => '미사용',
            'U454' => '가맹점번호 오류',
            'U455' => '계좌번호 오류',
            'U456' => '미사용',
            'U457' => '결제일자 오류',
            'U458' => '할부기간 오류 (MAX : 36개월)',
            'U459' => '카드번호 오류',
            'U460' => '약정한도 초과 ',
            'U461' => '매출번호(승인번호)오류',
            'U462' => '회원연체 상태 ',
            'U463' => '취소불가 (기거래)',
            'U464' => '연장일자 오류',
            'U465' => '연장불가 (원장오류)',
            'U466' => '취소오류 (누계금액이 취소금액 이하)',
            'U467' => '이미 할인실행 완료',
            'U468' => '대출약정이 되어있지 않음',
            'U501' => '효성 비밀번호 암호화->복호화 오류',
            'U505' => '효성 타행 카드 기타 거래불가 ',
            'U506' => '효성 타행 카드 개설은행 장애  ',
            'U507' => '효성 타행 카드 예금잔액부족 ',
            'U508' => '효성 타행 카드 예금잔액부족(타점권미결)',
            'U509' => '효성 타행 카드 대월한도초과',
            'U510' => '효성 타행 카드 수수료 부족',
            'U511' => '효성 타행 카드 잔액증명계좌',
            'U701' => '통화코드 오류',
            'U958' => '증권계좌 신규불가 (증권사 문의)',
            'U960' => '해당 증권사 시스템 장애',
            'U961' => '증권전산 시스템 장애',
            'U962' => '은행 시스템 장애',
            'U963' => '증권사 업무 마감',
            'U970' => '비밀번호 자리수 오류',
            'U971' => '비밀번호 연속번호 오류',
            'U972' => '비밀번호 중복 오류',
            'U973' => '우편번호 입력 오류',
            'U974' => '우편물 통지구분 오류',
            'U975' => '증권계좌 상태 오류 (증권사문의)',
            'U976' => '계좌종류 입력오류 (위탁,선물)',
            'U977' => '법인, 외국인 개설불가',
            'U990' => '증권계좌 해지불가 (증권사문의)',
            'U998' => '기타오류 (증권사문의)',
            'U999' => '시스템Busy (해당업체 유량제어중)',
        ),
    );
    
    /* KSNET 관련코드 */
    public static $array_ksnet_tran_info = Array(
        '630010555001' => '아프로 신탁',
        '04903132195681' => '예가람',
        '45901132739297' => '세종',
        '04801133120651' => '현대',
        '140010077121'   => '이엔에스',
        '30501132133267' => '남양1',
        '33001133040205' => '공평1',
        '02101230001719' => '더케이',
        '30501132129854' => '남양2',
        '30501132137279' => '남양3',
        '31401132083940' => '삼정',
        '15801132268075' => '인천',
        '33092130000270' => '공평2',
        '15161130000684' => '인성',
    );

    /* 자금집중 리스트(테크) (※절대수정금지※) */
    public static $arrayTranSsnTK = Array( 
        //"AFRO"=>Array("OUT"=>"100031508089","IN"=>"630010555001","IN_BANK"=>"081"),
        //"YEGARAM"=>Array("OUT"=>"140011586907","IN"=>"04903132195681","IN_BANK"=>"050"),
        //"SEJONG"=>Array("OUT"=>"140011586920","IN"=>"45901132739297","IN_BANK"=>"050"),
        //"HYUNDAI"=>Array("OUT"=>"140011586939","IN"=>"04801133120651","IN_BANK"=>"050"),
        //"ENS"=>Array("OUT"=>"140011586946","IN"=>"140010077121","IN_BANK"=>"088"),
        //"NAMYANG"=>Array("OUT"=>"140011587005","IN"=>"30501132133267","IN_BANK"=>"050"),
        //"GP"=>Array("OUT"=>"140011587076","IN"=>"33001133040205","IN_BANK"=>"050"),
        //"THEK"=>Array("OUT"=>"140011587215","IN"=>"02101230001719","IN_BANK"=>"050"),
        //"NAMYANG2"=>Array("OUT"=>"140011587158","IN"=>"30501132129854","IN_BANK"=>"050"),
        //"NAMYANG3"=>Array("OUT"=>"140011587279","IN"=>"30501132137279","IN_BANK"=>"050"),
        //"SAMJUNG"=>Array("OUT"=>"140011587293","IN"=>"31401132083940","IN_BANK"=>"050"),
        //"INCHEON"=>Array("OUT"=>"140011587304","IN"=>"15801132268075","IN_BANK"=>"050"),	// 12.인천저축 / 해지 / 2017-09-08 ~ 2022-05-23
        //"GP2"=>Array("OUT"=>"140011587310","IN"=>"33092130000270","IN_BANK"=>"050"),
        //"INSUNG"=>Array("OUT"=>"140012173039","IN"=>"15161130000684","IN_BANK"=>"050"),
        //"NAMYANG4"=>Array("OUT"=>"100032916873","IN"=>"30561130000414","IN_BANK"=>"050"),
        //"GP3"=>Array("OUT"=>"140011587005","IN"=>"33061130001104","IN_BANK"=>"050"),
        //"GP4"=>Array("OUT"=>"100031508089","IN"=>"33061130007362","IN_BANK"=>"050"),
        //"GORYEO"=>Array("OUT"=>"140011587126","IN"=>"10161130031435","IN_BANK"=>"050"),
        "SERAM"=>Array("OUT"=>"140011587076","IN"=>"32561130012990","IN_BANK"=>"050","IN_ACC_CMD"=>"청", "OUT_ACC_CMD"=>"청"),
        //"NH"=>Array("OUT"=>"140011587091","IN"=>"06202130661647","IN_BANK"=>"050"),
        //"NH"=>Array("OUT"=>"100033761059","IN"=>"06202130661647","IN_BANK"=>"050"),
        //"GP5"=>Array("OUT"=>"140011587005","IN"=>"33061130033210","IN_BANK"=>"050"),
        "CLSA"=>Array("OUT"=>"100034018172","IN"=>"100034018973","IN_BANK"=>"088","IN_ACC_CMD"=>"청", "OUT_ACC_CMD"=>"청"),
        //"KB"=>Array("OUT"=>"140012173039","IN"=>"06501133237603","IN_BANK"=>"050"),
        //"SERAM2"=>Array("OUT"=>"140010077121","IN"=>"32561130012990","IN_BANK"=>"050"),	// 25.세람2 / 해지 / 2021-03-17 ~ 2023-10-04
        //"WOORI"=>Array("OUT"=>"140011587005","IN"=>"1005004340263","IN_BANK"=>"020"),		// 26.우리금융캐피탈 / 해지 / 2022-05-16 ~ 2023-05-31
        "WOORI2"=>Array("OUT"=>"140011586939","IN"=>"1005804362667","IN_BANK"=>"020","IN_ACC_CMD"=>"청", "OUT_ACC_CMD"=>"청"),		// 27.우리금융캐피탈2 / 운영중 / 2022-07-06 ~
    );
    
    /* 자금집중 리스트(흥국) (※절대수정금지※) */
    public static $arrayTranSsnHK = Array( 
        "HK"=>Array("OUT"=>"140012052799","IN"=>"100032610740","IN_BANK"=>"088","IN_ACC_CMD"=>"청", "OUT_ACC_CMD"=>"청"),
        "HK2"=>Array("OUT"=>"100031500321","IN"=>"100032959928","IN_BANK"=>"088","IN_ACC_CMD"=>"청", "OUT_ACC_CMD"=>"청"),
        "HK3"=>Array("OUT"=>"140012173039","IN"=>"15891001837404","IN_BANK"=>"081","IN_ACC_CMD"=>"청", "OUT_ACC_CMD"=>"청"),
    );

    /* 자급집중 리스트(유미) (※절대수정금지※) */
    public static $arrayTranSsnYM = Array( 
        //"YM"=>Array("OUT"=>"55002317304111", "OUT_BANK"=>"003", "IN"=>"1012080819904", "IN_BANK"=>"032", "IN_ACC_CMD"=>"유미캐피탈", "OUT_ACC_CMD"=>"부산은행신탁"),
        "BC"=>Array("OUT"=>"55002317304142", "IN"=>"19891002573104", "IN_BANK"=>"081", "IN_ACC_CMD"=>"유미캐피탈", "OUT_ACC_CMD"=>"비씨카드집금"),
        "BNK"=>Array("OUT"=>"67403039504055", "IN"=>"1012086384700", "IN_BANK"=>"032", "IN_ACC_CMD"=>"유미캐피탈", "OUT_ACC_CMD"=>"BNK집금"),
        "OKB"=>Array("OUT"=>"55002317304111", "IN"=>"06461135074452", "IN_BANK"=>"050", "IN_ACC_CMD"=>"유미캐피탈", "OUT_ACC_CMD"=>"OKB집금"),
    );

    /* 테스트 송금 리스트 (※절대수정금지※) */
    public static $arrayTranSsnTEST1 = Array(
        "TEST1"=>Array("BALANCE"=>"1", "OUT"=>"55002317304014", "IN_BANK"=>"003", "IN"=>"55002317304135", "IN_ACC_CMD"=>"유미캐피탈", "OUT_ACC_CMD"=>"유미캐피탈")
    );

    /* 테스트 송금 리스트 (※절대수정금지※) */
    public static $arrayTranSsnTEST2 = Array(
        "TEST2"=>Array("BALANCE"=>"1", "OUT"=>"100031500271", "IN_BANK"=>"088", "IN"=>"140012093696", "IN_ACC_CMD"=>"테크홀딩스", "OUT_ACC_CMD"=>"테크홀딩스")
    );

    /* KSNET 공통부 컬럼 */
    public static $array_ksnet_tbl = Array(
        /* 거래내역 통지 (거래일자, 은행코드, 업체코드) */
        'TRADE_DATA_TBL' => array(
            'DEAL_DATE',
            'BANK_CODE',
            'COMP_CODE'
        ),
        /* 타행불능 수신 (송신일자, 은행코드, 업체코드) */
        'TA_ERR_TBL' => array(
            'TRAN_DATE',
            'BANK_CODE',
            'COMP_CODE'
        ),
        /* 성명조회/송금/처리결과 조회 요청 테이블 (요청일자, 은행코드, 업체코드) */
        'TRADE_REQUEST_TBL' => array(
            'REQ_DATE',
            'BANK_CODE',
            'COMP_CODE'
        )
    );
    
    /* KSNET firm_status 관련코드 */
    // public static $array_ksnet_firm_status = Array(
    //     'A' => '성명조회등록',
    //     'Y' => '성명조회결과값 조회',
    //     'Z' => '성명조회 실패',

    //     'C' => '송금요청',
    //     'D' => '송금확인',
    //     'E' => '완료',
    //     'F' => '중복송금확인',
    //     'G' => '송금실패(중복송금)',
    //     'U' => '송금재요청',
    //     'X' => '송금실패',
    // );
    
    // /* KSNET trade_status 관련코드 */
    // public static $array_ksnet_trade_status = Array(
    //     'C' => '송금요청',
    //     'Y' => '송금예약',
    //     'A' => '송금중',
    //     'E' => '중복완료',
    //     'F' => '송금실패',
    //     'Q' => '완제처리건',
    // );

    public static $arrayInvestmentStatus = Array(
        'A'=>'상환중',
        'B'=>'연체',
        'C'=>'상환중',
        'D'=>'연체',
        'E'=>'상환완료',
        'P'=>'만기연장종료',
        'S'=>'종료',
		'M'=>'종료',
        'Y'=>'종료',
        'H'=>'종료',
        'N'=>'대기'
    );

    // 투자자 징구서류
    public static $arrayInvestPaper = Array(
        '01'=>'계약서',
        '02'=>'확약서',
        '03'=>'사모사채 양도양수 계약서',
        '04'=>'계약서(연장)'
    );
    
    // 이자지급스케줄명세 탭
    public static $arrayRemittanceDays = Array(
        'ALL'=>'전체',
        '0'=>'D - DAY',
        '1'=>'D - 1',
        '2'=>'D - 2',
        '3'=>'D - 3'
    );
    
    // 이체실행결재 탭
    public static $arrayAccountStatus = Array(
        'ALL'=>'전체',
        'S'=>'요청',
        'W'=>'대기',
        'A'=>'진행',
        'Y'=>'완료',
        'F'=>'실패',
        'N'=>'취소'
    );
    
    // 이체실행결재 배치상태
    public static $arrayFirmBankingStatus = Array(
        'S'=>'성명조회등록',
        'W'=>'성명조회확인',
        'Z'=>'성명조회실패',
        'A'=>'송금이체등록',
        'Y'=>'송금이체확인',
        'E'=>'송금이체완료',
        'X'=>'송금이체실패',
        'F'=>'송금응답실패',
        'U'=>'송금재조회'
    );
    
    // 입출금계좌 적요 세팅
    public static $arrayAccCmd = Array(
        'account_transfer' => array(
            // 청
            '1' => array(
                '01' => array('in_cmd' => '청', 'out_cmd' => '사채'),
                '02' => array('in_cmd' => '청', 'out_cmd' => '우선'),
                '03' => array('in_cmd' => '청', 'out_cmd' => '020100'),
                //'02' => array('in_cmd' => '테크홀딩스', 'out_cmd' => '배당'),
            ),
            // 테크홀딩스
            '2' => array(
                '01' => array('in_cmd' => '청', 'out_cmd' => '사채'),
                '02' => array('in_cmd' => '청', 'out_cmd' => '우선'),
                '03' => array('in_cmd' => '청', 'out_cmd' => '020100'),
                //'2' => array('in_cmd' => '테크홀딩스', 'out_cmd' => '배당'),
            ),
            // 유미캐피탈
            '3' => array(
                '01' => array('in_cmd' => '유미캐피탈', 'out_cmd' => '사채'),
                '02' => array('in_cmd' => '유미캐피탈', 'out_cmd' => '우선'),
                '03' => array('in_cmd' => '유미캐피탈', 'out_cmd' => '차입'),
                //'2' => array('in_cmd' => '테크홀딩스', 'out_cmd' => '배당'),
            )
        ),
        'cost_transfer' => array(
            // 청
            '1' => array(
                '1' => array('in_cmd' => '청', 'out_cmd' => ''),
            ),
            // 테크홀딩스
            '2' => array(
                '2' => array('in_cmd' => '청', 'out_cmd' => ''),
            ),
            // 유미캐피탈
            '3' => array(
                '2' => array('in_cmd' => '유미캐피탈', 'out_cmd' => ''),
            )
        )
    );

	/**
     * 거래내역구분
     *
     * @var array
     */
    public static $arrayMoAcctTrade = array(
        '20'=>'입금',
        '30'=>'출금',
        '51'=>'입금취소',
        '52'=>'출금취소',
    );

	/**
     * 현장관리 탭 상태
     *
     * @var array
     */
    public static $arrayFieldStaTab = array(
        'ALL'=>'전체',
        'N'=>'대기',
        'A'=>'진행중',
        'E'=>'완료',
    );

	/**
     * 투자상태
     *
     * @var array
     */
    public static $arrayInvSta = array(
        'N'=>'지급대기',
        'A'=>'지급중',
        'E'=>'지급완료',
    );

	/**
    * 투자상태 색상
    *
    * @var array
     */
    public static $arrayInvStaColor = array(
        'N'=>'<span class="status-text-n">지급대기</span>',
        'A'=>'<span class="status-text-b">지급중</span>',
        'E'=>'<span class="status-text-a">지급완료</span>',
    );
    
    /* 
        YES or NO
    */
    public static $arrayUseYn = Array(
        'Y'=>'사용', 
        'N'=>'미사용', 
    );

    /* 
        YES or NO
    */
    public static $arrayUseBank = Array(
        'S'=>'신한은행', 
        'W'=>'우리은행',
        'k'=>'기업은행',
    );
    
    /* 
        YES or NO
    */
    public static $arraySendYn = Array(
        'Y'=>'지급완료', 
        'N'=>'-', 
    );
}